<?php
return [
	'welcome'       => 'Բարի գալուստ',
	'courses' => 'Դասընթացներ',
	'portfolio' => 'Պորտֆոլիո',
	'ourteam' => 'Մեր թիմը',
	'opinions' => 'Կարծիքներ',
	'contact' => 'Կապ',
	'signup' => 'Գրանցվել',
	'learnmore' => "Իմանալ ավելին",
	'yourpath' => 'Հաջողակ դառնալու քո ուղին',
	'thebest' => 'Լավագույնը մեզ հետ',
	'training' => 'Ուսուցում',
	'practice' => 'Պրակտիկա',
	'job' => 'Աշխատանք',
	'training_text' => 'Հետևելով տեղեկատվական տեխնոլոգիաների արագ զարգացմանը՝ մենք առաջարկում ենք խմբակային և
                                անհատական խորացված դասընթացներ, ռեալ պրոյեկտներ, թիմային աշխատանքներ։',
	'practice_text' => 'Մասնագիտական վերապատրաստման լավագույն հնարավորությունը մեզ հետ՝ լավագույն մանսագետների
                                հսկողությամբ և նորարարական գաղափարների գեներացմամբ։',
	'job_text' => '8 տարվա ընթացքում Կենտրոնին հաջողվել է պատրաստել 1000 և ավելի մասնագետներ, ովքեր այսօր
                                աշխատում են Հայաստանի լավագույն կազմակերպություններում։',
	'taughtlanguages' => "Դասավանդվող լեզուներ",
	'introduction' => 'Ծանոթացում վեբ կայքերի ստեղծման սկզբունքներին',
	'year' => 'Տարի',
	'student' => 'Ուսանող',
	'lesson' => 'Դաս',
	'html' => "HyperText Markup Language Համարվում է հիպերտեքստ նշագրման լեզու:Այն հանդիսանում է կայքի կմաղքը, կամ հիմքը որի վրա հավաքվում է բուն կայքը:",
	'css' => "CSS կամ կասկադային ոճաթերթ (Cascading Style Sheets), այն
   օգտագործվում է վեբ-էջեր նախագծողների կողմից գույներ, տառատեսակներ,
 գտնվելու վայր և այլ նկարագրություններ տալու համար։CSS-ը հիմնականում
   օգտագործվում է HTML և XHTML ֆորմատի պատկանող վեբ-էջերի ձևավորման
   համար։",

	'upcomingcourse' => "Դասընթացներ",
	'dram' => "Դրամ",
	'month' => "ամիս",
	'lessonsperweek' => "դաս շաբաթական",
	'hours' => "ժամ տևողությամբ",
	'signup' => "Գրանցվել",
	'beginner' => "Սկսնակ",
	'studentworks' => "Պորտֆոլիո",
	'Ourteam' => "Մեր թիմը",
	'becomeoneofus' => "Դարձիր մեզանից մեկը",
	'hegine' => "Հեղինե Մկրտչյան",
	'arevik' => "Արևիկ Հայրապետյան",
	'specialist' => "մասնագետ",
	'andranik' => "Անդրանիկ Հողմրցյան",
	'syuzanna' => "Սյուզաննա Անտոնյան",
	'levon' => "Լևոն Երիցյան",
	'alisa' => "Ալիսա Մարգարյան",
	'alisatext' => "Սա շատ լավ և հաճելի ուսումնական կենտրոն է WEB ծրագրավորում սովորելու համար: ",
	'developer' => "Ծրագրավորող",
	'nareksardaryan' => "Նարեկ Սարդարյան",
	'nareksardaryantext' => "Շատ շնորհակալ եմ ձեր տված գիտելիքների,պրակտիկայի և աշխատանքի համար։Բոլոր նրանց,ովքեր ցանկանում են գիտելիքներ ստանալ ծրագրավորման ոլորտում խորհուրդ կտամ դիմել  RootTeam ուսումնական կենտրոնին։",
	'narekyazeryan' => "Նարեկ Յազերյան",
	'narekyazeryantext' => "Պրոֆեսիոնալ անձնակազմ և հրաշալի ուսումնական պլան: Շատ գոհ եմ և վստահորեն խորհուրդ եմ  տալիս դիմե՛լ:",
	'levonhakhyan' => "Լևոն Հախյան",
	'levonhakhyantext' => "Շատ շնորհակալ եմ ձեր տրված գիտելիքերի համար!!!",
	'hripsimemanukyan' => "Հռիփսիմե Մանուկյան",
	'hripsimemanukyantext' => "Ծրագրավորում սովորելու լավագույն տեղը :)",
	'hovhanneskhachatryan' => "Հովհաննես Խաչատրյան",
	'hovhanneskhachatryantext' => "Ամենալավ ուսումնական կենտրոններից է, բոլորին խորհուրդ կտամ հաճախել։)",
	'contactus' => "Կապը մեզ հետ",
	'followus' => "Հետևիր մեզ ՝",
	'yerevan' => " ք. Երևան,",
	'address' => " Տիգրան Մեծ 49,3-րդ հարկ",
	'addr' => "Հասցե",
	'email' => "Էլ․ փոստ",
	'phone' => "Հեռախոս",
	'question' => "Հարցե՞ր կամ առաջարկներ ունես։ ",
	'writeus' => "Ուրեմն գրիր մեզ և մենք կպատասխանենք հնարավորինս շուտ։",
	'send' => "Ուղարկել",
	'subscribe' => "Բաժանորդագրվիր",
	'bethefirst' => "Առաջինը տեղեկացիր մեր նորությունների և դասընթացների մասին։",
	'yourname' => "Ձեր անունը",
	'emailadress' => "Էլ․ փոստ",
	'enteryourmessage' => "Մուտքագրեք ձեր հաղորդագրությունը",
	'comecolibrilab' => "Արի RootTeam",
	'learnprof' => "Սովորիր ամենապահանջված մասնագիտությունը",
	'developskills' => "Զարգացրու մասնագիտական ունակություններդ",
	'becomeprogrammer' => "Դարձիր ծրագրավորող։ Ունեցիր բարձր աշխատավարձ",
	'makingpower' => "Դարձնելով գիտելիքը ուժ",
	'joinus' => "Միացիր մեզ",
	'bootstrap' => "Bootstrap, վեբ կայքերի և հավելվածների ստեղծման համար բաց կոդով ազատ և
            անվճար գրադարան։ Այն պարունակում է HTML-ի և CSS-ի հիմքով ֆորմաների,
            ստեղների, նավիգացիոն մենյուների և արտաքին տեսքի այլ բաղադրիչների
            կաղապարներ, ինչպես նաև JavaScript հավելվածներ։ Այն նպատակ ունի հեշտացնել
            դինամիկ կայքի և վեբ հավելվածի ստեղծումը։ Bootstrap-ը կայքի դիմային մասի
            ֆրեյմվորկ է, ուստի նրա կոդը հասանելի է օգտագործողին, ի տարբերություն
            սերվերային կոդին։",
	'close' => "Փակել",
	'java1' => "ՋավաՍկրիպտը (անգլ.՝ JavaScript) համացանցում ամենահանրահայտ սկրիպտային լեզուն է և աշխատում է բոլոր հանրահայտ բրաուզերներում",
	'java2' => "ՋավաՍկրիպտը նախագծվել է կայքերի HTML էջերին դինամիկություն հաղորդելու համար",
	'java3' => "ՋավաՍկրիպտը սովորաբար ներառվում է ուղղակիորեն HTML ֆայլերի մեջ",
	'java4' => "ՋավաՍկրիպտը ինտերպրետացվող, սկրիպտային լեզու է",
	'jquery' => "jQuery, JavaScript գրադարան, որը կենտրոնացված է JavaScript-ի և HTML-ի
            փոխազդեցությունն հեշտացնելու համար։ jQuery գրադարանի օգնությամբ կարելի է
            հեշտությամբ ընտրել DOM տարրը, դիմել դրա ատրիբուտներին ու
            բովանդակությանը, փոփոխել դրան
            ք։ jQuery-ն ունի նաև AJAX-ի հետ աշխատելու
            համար պարզ և հասկանալի API",
	'react' => "React (երբեմն ձևակերպված է React.js կամ ReactJS), բաց կոդով JavaScript
            գրադարան է user ինտերֆեյս կառուցելու համար:React-ը թույլ է տալիս
            մշակողներին ստեղծել խոշոր վեբ ծրագիր, որը օգտագործում է տվյալներ, որոնք
            ժամանակի ընթացքում փոխվում են առանց էջը վերբեռնելու: Դրա հիմնական
            նպատակը արագ, պարզ և լայնածավալ լինելն է: React-ը ծրագրերում գործի է
            դնում միայն օգտատիրոջ ինտերֆեյսը ",
	'php' => "PHP-ն (անգլ.՝ PHP: Hypertext Preprocessor, «PHP՝ Հիպերտեքստային
            Պրեպրոցեսսոր») ընդհանուր նշանակության սկրիպտային ծրագրավորման լեզու է,
            որն ինտենսիվորեն օգտագործվում է վեբ ծրագրավորման մեջ։ Ներկայումս այն
            աջակցվում է հոսթինգ տրամադրող ընկերությունների ճնշող մեծամասնության
            կողմից և հանդիսանում է առաջատար ծրագրավորման լեզուներից մեկը, որոնք
            կիրառվում են դինամիկ վեբ-կայքերի ստեղծման համար",
	'laravel' => "Laravel, անվճար, բաց կոդով վեբ-ֆրեյմվորք, որը մշակված է MVC
            ճարտարապետական ​​մոդելի (անգլ. ՝ Model View Controller) մշակման համար:
            Laravel- ը թողարկվում է MIT լիցենզիայի ներքո:
            Ծրագրի սկզբնական կոդը տեղադրված է GitHub- ում: 2013 թ.-ի դեկտեմբերին
            sitepoint.com հարցման արդյունքում ՝ PHP- ի ամենահայտնի շրջանակների
            համար, Laravel-ը դասվել է 2014 թ.-ի ամենահեռանկարային նախագիծը",
	'html_css' => "<li> HTML ֆունդամենտալ թեգեր, սիմվոլներ, ցուցակներ</li>
            <li> Աղյուսակներ, iframe թեգ, մուլտիմեդիա</li>
            <li>head թեգում գործածվող թեգեր, վեբ էջի հիմնական կառուցվածք</li>
            <li>HTML թեգեր և ատրիբուտներ, ինֆորմացիայի մուտքագրման
            համակարգ</li>
            <li>Ծանոթացում CSS-ի հետ, selector-ներ և կոմբինատորներ, տառերի
            և տեքստերի հետ աշխատանք</li>
            <li>Background հատկանիշ, չափսերի հատկանիշներ</li>
            <li>Box մոդել, Border, Outline, Padding, Margin, Display
            հատկանիշ</li>
            <li>Pseudo էլեմենտներ, Էջում էլեմենտների դասավորվածության հետ
            աշխատանք</li>
            <li>Responsive դիզայն, անիմացիաներ</li>
            <li> Flexbox</li>
            <li>Փուլի ամփոփում</li>
            <li>Թեստ</li>",

	'bootstrap_more' => "<li>Ինչ է Bootstrap -ը և ինչպես կիրառել այն</li>
      <li>Bootstrap-ի բաղադրիչները</li>
      <li>Ինչպես օգտագործել պատրաստի կոդերը</li>
      <li>Container-fluid, Container</li>
      <li>Dropdown Menu և Navbar-ի բաղադրիչները</li>
      <li>Responsive Images</li>
      <li>Bootstrap Tables</li>
      <li>Bootstrap Form</li>
      <li>Bootstrap Labels, Thumbnail, Jumbotron</li>
      <li>Bootstrap Media Objects և List Group</li>",




	'javascript' => "<li>Ծանոթացում JavaScript ծրագրավորման լեզվին :Ընդհանուր ծանոթացում ծրագրավորման հետ։ Ծանոթացում JS-ին՝ փոփոխականներ և օպերատորներ։ Data Type-երը JS-ում:</li>
    <li>Պայմանական կառուցվածքներ (if, switch , ternary operator) և տրամաբանական օպերատորներ։ let, var, const keyword-ների տարբերությունը
    </li>
    <li>Primitive type-երի բոլոր մեթոդների աշխատանքը</li>
    <li>Ծանոթացում օբյեկտների հետ և դրանց կարևորությունը JS-ում
    </li>
    <li>for, for in, while և do while ցիկլեր։ Գլոբալ և լոկալ scope-երի տարբերությունները</li>
    <li>Array օբյեկտի տվյալի տեսակ։ Array-ի և Object-ի տարբերությունները։ Array-ի մեթոդները և դրանց կարևորությունները</li>
    <li>Ֆունկցիաներ, դրանց դերը JS-ում։ Hoisting-ի աշխատանքը JS-ում: Function Expression և Function Declaration, դրանց նմանությունները և տարբերությունները</li>
    <li>Callback functions:
    </li>
    <li>Ռեկուրսիա</li>
    <li>Աշխատանք this-ի հետ։ call, apply և bind մեթոդների ուսումնասիրում</li>
    <li>setTimeout և setInterval ֆունկցիաների ասինխրոն աշխատանքը: Ծանոթացում Date և Math օբյեկտներին։ Regular Expressions</li>
    <li>Ծանոթացում DOM-ի։ Աշխատանք Event-ների հետ</li>
    <li>Փուլի ամփոփում, թեստի նախապատրաստում</li>
    <li>Թեստ</li>",
	'jquery_more' => "<li>jQuery: Ծանոթություն</li>
    <li>jQuery գրադարանի տեղադրում</li>
    <li>jQuery գրելաձևը</li>
    <li>Մեթոդներ</li>
    <li>Հիմնական գործիքներ</li>
    <li>jQuery Event մեթոդներ</li>
    <li>Նոր էլեմենտների ներմուծում և արտածում</li>
    <li>CSS մանիպուլացիաներ</li>
    <li>էֆեկտներ և անիմացիաներ</li>",
	'react_more' => "<li>React ներածություն: Ինչ է ReactJs-ը </li>
    <li> Ինչպես ստեղծել դատարկ պրոյեկտ: ReactJs պրոյեկտի կառուցվածքը</li>
    <li>Ֆայլերի import , export</li>
    <li>ES 2015-ի հիմնական բաղադրիչները </li>
    <li>ReactJs-ի էլեմենտները ,կոմպոնենտները </li>
    <li>ReactJs-ի հիմնական տարրերը և բաղադրիչները</li>
    <li>Virtual DOM, բաղադրիչների միջև կապը և հաղորդակցությունը(Props, Refs)</li>
    <li>ReactJs-ի կոմպոնենտները:Կոմպոնենտ class- էր,Կոմպոնենտ function- էր</li>
    <li>Կոմպոնենտների state- ներ, event- ներ</li>
    <li>Ինչ է routing-ը : Link, Navlink :Ինչպես է աշխատում Router-ը
    </li>
    <li>SetState() : setState էլեմենտներ ջնջել, ավելացնել</li>
    <li>ReactJs-ի և հեռահար սերվերների հաղորդակցումը:	Fetch Api:</li>
    <li>ReactJs Lifecycle մեթոդները( componentDidMount() ,componentDidUpdate() ,componentWillUnmount(), componentDidCatch() )
    </li>
    <li>ReactJs-ի հետ կիրառվող գործիքներ․ներածություն (npm / yarn, webpack)</li>
    <li>Թեստ</li>",
	'php_more' => "<li>Սերվեր,ինտերպրիտացիոն լեզու,այլ լեզուներ</li>
     <li>Փոփոխականների տիպերը,տիպերի ստուգման և փոփոխություն</li>
     <li>Ֆունկցիաներ,ռեկուրսիվ ֆւնկցիաներ,մաթեմատիկական ֆունկցիաներ</li>
     <li>Զանգվածների հետ աշխատող ֆունկցիաներ</li>
     <li>Տողերի հետ աշխատող ֆունկցիաներ.</li>
     <li>Ժամանակի հետ աշխատող ֆունկցիաներ.</li>
     <li>Սուպերգլոբալ զանգվածներ,ajax</li>
     <li>Ֆայլերի և թղթապանակների հետ աշխատող ֆունկցիաներ,ներբեռնում և արտաբեռնում</li>
     <li>Ռեգուլյար արտահայտություններ</li>
     <li>MySQL տվյալների բազա,ռելացիոն բազաներ</li>
     <li>MySQL մոնիտոր, MySQL տվյալների բազայի նախագծման սկզբունքները,տվյալների տիպեր</li>
     <li>Պահպանման engine-ներ</li>
     <li>Հարցման հրամաններ : Select, Delete, Update  և այլն</li>
     <li>Մոդիֆիկատորներ</li>
     <li>Խմբավորման ֆունկցիաներ</li>
     <li>Join-ներ(միացում), Groups by(խմբավորում), Order by(դասավորում)</li>
     <li>PHP Mysql ֆունկցիաներ, ապահով տրանզակցիաներ</li>
     <li>Class-ի հայտարարումը, Մեթոդներ և հատկություններ</li>
     <li>Կոնստրուկտորներ և դեստրուկտորներ,ժառանգում</li>
     <li>Կլասների հետ աշխատող ֆունկցիաներ</li>
     <li>Կլասի հաստատուններ, ստատիկ հատկություններ և ֆունկցիաներ</li>
     <li>Ինկապսուլացիա,պոլիմորֆիզմ,հասանելիության մոդիֆիկատորներ</li>
     <li>Աբստրակտ կլասներ և ֆունկցիաներ</li>
     <li>ինտերֆեյսներ</li>
     <li>Trait-ներ</li>
     <li>Մոգական մեթոդներ</li>
     <li>Մոգական հաստատուններ</li>
     <li>Final կլասներ</li>
     <li>PHP Exeption</li>
     <li>Class-ի design pattern-ներ Factory,Singleton, MVC</li>
     <li>REST API,Codeigniter</li>
     <li>Թեստ</li>
     ",
	'laravel_more' =>
	"<li>Ծանոթություն</li>
<li>Laravel կառուցվածքը</li>
<li>Laravel կարգավորումները</li>
<li>Laravel մոդել</li>
<li>Laravel միջնորդ(Middleware)</li>
<li>Կոնտրոլերներ</li>
<li>Routing</li>
<li>Պատասխանի(Response) սկզբունքները: JSON պատասխան</li>
<li>Cookie-ներ: ստեղծումը և օգտագործումը</li>
<li>Տեսքեր(Views) և տվյալների փոխանցում</li>
<li>Blade շաբլոններ</li>
<li>Redirect-ներ: redirect դեպի կոնտրոլեր</li>
<li>Տվյալների բազա</li>
<li>Error-ներ և Logging</li>
<li>Ֆորմաներ</li>
<li>Տեղայնացում</li>
<li>Session տվյալներ։ ստեղծում,օգտագործում,վերացում </li>
<li>Վալիդացիա</li>
<li>Ֆայլերի արտածում էլ․ փոստի առաքում</li>
<li>Ajax</li>
<li>HTTP Exceptions</li>
<li>Facad-ներ</li>
<li>Անվտանգություն</li>
<li>Թեստ</li>
",
	'create_account' => 'Ստեղծել հաշիվ',
	'log_in' => 'Մուտք գործել',
	'public_link' => 'Սա հասանելի հղում է',
	'if_public' => 'Եթե հղումն հասանելի է, ապա այն հասանելի է բոլուի համար',
	'your_cv' => 'Քո CV-ն կտեղադրվի colibrilab.am/cv/yourid էջում',
	'create' => 'ՍՏԵՂԾԵԼ',
	'password' => 'Գաղտնաբառ',
	'create_your' => "Ստեղծիր քո",
	'online_cv' => "օնլայն CV-ն",
	'few_min' => "մի քանի րոպեում",
	'we_help' => "Մենք կօգնենք քեզ ունենալ պրոֆեսիոնալ և",
	'good_cv' => "ներկայանալի ռեզյումե:",
	'please_sign' => "Ռեզյումեն ստեղծելու համար խնդրում ենք մուտք գործել",
	'supporters' => "Աջակիցներ",
	'frequently_questions' => "ՀՏՀ",
	'discount_policy' => "Զեղչային քաղաքականություն",
	'security_policy' => "Անվտանգության քաղաքականություն",
	'forgot_password' => "Մոռացե՞լ եք գաղտնաբառը",
	'agree' => "Համաձայն եմ կայքի",
	'chapter' => "կանոնադրությանը",
	'next' => "Առաջ",
	'cancel' => "Չեղարկել",
	'other' => "Այլ",
	'check_speed' => "Ստուգիր տեքստ մուտքագրելու արագությունդ",
	'test_help' => "Թեստը կօգնի պարզել, թե ինչ արագությամբ ես կարողանում գրել ստեղնաշարով",
	'starttest' => "Սկսել Թեստը",
	'ishxan' => 'Իշխան Մելքոնյան',
	'manager' => 'մենեջեր',
	'coordinator' => 'Համակարգող',
	'azniv' => 'Ազնիվ',
	'anna' => 'Աննա Մուրադյան',
	'administrator' => 'ադմինիստրատոր',
	'ararat' => 'Արարատ Համբարձումյան',
	'haykaz' => 'Հայկազ Ոսկանյան',
	'aram' => 'Արամ Խաչատրյան',
];
