<?php
return [
  'contact'=>'Կապ',
  'create_cv'=>'Ստեղծել CV',
  'testspeed'=>'Մուտքագրման արագության թեստ',
  'faq'=>'Հաճախակի տրվող հարցեր',
  'opinion'=>'Ձեր կարծիքը',
  'register_title'=>'Գրանցվել',
  'fag_title'=>"ՀՏՀ",
  'discount_title'=>"Զեղչային Քաղաքականություն",  
  'privacy_title'=>"Անվտանգության Քաղաքականություն",
  'invalid_email'=>"Գոյություն չունեցող էլ․հասցե",
  'require'=>"Լրացրեք բոլոր դաշտերը",
  'success'=>'Հաղորդագրությունն հաջողությամբ ուղարկվել է',
    
];