<?php





return[
    'start'=>"Սկսել թեստը",
    'check_speed'=>"Ստուգիր տեքստ մուտքագրելու արագությունդ",
    'sec'=>"վրկ",   
    'tray'=>"Նորից փորձիր ։)", 
    'per_min'=>"բառ մեկ րոպեում", 
    'accuracy'=>"Ճշգրտությունը ՝",
    'try_faster'=>"Փորձիր ավելի արագ!",   
    'share'=>"Կիսվել՝",   
    'try_again'=>"ԿՐԿԻՆ ՓՈՐՁԵԼ",
    'tooslow'=>'Շա՜տ դանդաղ էր ։(',
    'good'=>'Բավականին արագ ես գրում!',
    'superspeed'=>'Սուպեր Արագություն!',
    'word'=>"բառ",
    'wordspermin'=>"բառ մեկ րոպեում`", 
    'seconds'=>"վայրկյանում",
    'lang'=>"arm",    
];